# ClipPlane Class

---
A set of parameters representing a clip plane in DirectContext3D.
SystemObject Autodesk.Revit.DB.DirectContext3DClipPlane
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ClipPlane : IDisposable

    Public Class ClipPlane
    	Implements IDisposable

    public ref class ClipPlane : IDisposable

    type ClipPlane =
        class
            interface IDisposable
        end
The ClipPlane type exposes the following members.
| Name| Description
---|---|---
| ClipPlane|  Constructs a copy of the clip plane.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Normal|  The plane's normal vector.
| Origin|  The plane's origin.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ClipPlane
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.DirectContext3D Namespace